micropython/micropython/ports/esp32/boards/XIAO_ESP32C3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "XIAO-ESP32C3"
#define MICROPY_HW_MCU_NAME                 "ESP32-C3FN4"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "XIAO-ESP32C3"

#define MICROPY_HW_ENABLE_SDCARD            (0)
#define MICROPY_PY_MACHINE_DAC              (0)
#define MICROPY_PY_MACHINE_I2S              (0)

#define MICROPY_HW_I2C0_SCL                 (7)
#define MICROPY_HW_I2C0_SDA                 (6)

#define MICROPY_HW_SPI1_MOSI                (10)
#define MICROPY_HW_SPI1_MISO                (9)
#define MICROPY_HW_SPI1_SCK                 (8)
